In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./data/financial-data.csv')

In [3]:
df.shape # Return a tuple representing the dimensionality of the DataFrame. (rows,columns)

(50, 13)

In [4]:
df.columns #

Index(['Series_reference', 'Period', 'Data_value', 'Suppressed', 'STATUS',
       'UNITS', 'Magnitude', 'Subject', 'Group', 'Series_title_1',
       'Series_title_2', 'Series_title_3', 'Series_title_4'],
      dtype='object')

In [5]:
type(df.columns)

pandas.core.indexes.base.Index

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  50 non-null     object
 1   Period            50 non-null     float64
 2   Data_value        50 non-null     float64
 3   Suppressed        0 non-null      float64
 4   STATUS            50 non-null     object
 5   UNITS             50 non-null     object
 6   Magnitude         50 non-null     int64
 7   Subject           50 non-null     object
 8   Group             50 non-null     object
 9   Series_title_1    50 non-null     object
 10  Series_title_2    50 non-null     object
 11  Series_title_3    50 non-null     object
 12  Series_title_4    50 non-null     object
dtypes: float64(3), int64(1), object(9)
memory usage: 5.2+ KB

In [7]:
df.head(2)

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4
0,BDCQ.SF1AA2CA,2016.06,1116.386,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted
1,BDCQ.SF1AA2CA,2016.09,1070.874,NaN,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Unadjusted

In [8]:
df.isna().sum()

Series_reference     0
Period               0
Data_value           0
Suppressed          50
STATUS               0
UNITS                0
Magnitude            0
Subject              0
Group                0
Series_title_1       0
Series_title_2       0
Series_title_3       0
Series_title_4       0
dtype: int64

In [9]:
# since suppressed columns have all null values, will drop it
df.drop('Suppressed', axis = 1, inplace = True)

In [10]:
df.columns

Index(['Series_reference', 'Period', 'Data_value', 'STATUS', 'UNITS',
       'Magnitude', 'Subject', 'Group', 'Series_title_1', 'Series_title_2',
       'Series_title_3', 'Series_title_4'],
      dtype='object')

In [11]:
series = df['Subject']

In [12]:
type(series)

pandas.core.series.Series

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.tail(1)

,Series_reference,Period,Data_value,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4
49,BDCQ.SF1AA2CS,2022.06,1604.304,F,Dollars,6,Business Data Collection - BDC,Industry by financial variable (NZSIOC Level 2),Sales (operating income),Forestry and Logging,Current prices,Seasonally adjusted

In [15]:
df.sort_index(axis = 1, inplace=True) #sorting the columns

In [16]:
df.head(2)

,Data_value,Group,Magnitude,Period,STATUS,Series_reference,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Subject,UNITS
0,1116.386,Industry by financial variable (NZSIOC Level 2),6,2016.06,F,BDCQ.SF1AA2CA,Sales (operating income),Forestry and Logging,Current prices,Unadjusted,Business Data Collection - BDC,Dollars
1,1070.874,Industry by financial variable (NZSIOC Level 2),6,2016.09,F,BDCQ.SF1AA2CA,Sales (operating income),Forestry and Logging,Current prices,Unadjusted,Business Data Collection - BDC,Dollars

# Titanic data

In [18]:
df = pd.read_csv('./data/titanic.csv')

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   891 non-null    int64
 1   PassengerId  891 non-null    int64
 2   Survived     891 non-null    int64
 3   Pclass       891 non-null    int64
 4   Name         891 non-null    object
 5   Sex          891 non-null    object
 6   Age          714 non-null    float64
 7   SibSp        891 non-null    int64
 8   Parch        891 non-null    int64
 9   Ticket       891 non-null    object
 10  Fare         891 non-null    float64
 11  Cabin        204 non-null    object
 12  Embarked     889 non-null    object
dtypes: float64(2), int64(6), object(5)
memory usage: 90.6+ KB

In [21]:
df.iloc[:,:5]

,Unnamed: 0,PassengerId,Survived,Pclass,Name
0,0,1,0,3,"Braund, Mr. Owen Harris"
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,2,3,1,3,"Heikkinen, Miss. Laina"
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
4,4,5,0,3,"Allen, Mr. William Henry"
...,...,...,...,...,...
886,886,887,0,2,"Montvila, Rev. Juozas"
887,887,888,1,1,"Graham, Miss. Margaret Edith"
888,888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie"""
889,889,890,1,1,"Behr, Mr. Karl Howell"
890,890,891,0,3,"Dooley, Mr. Patrick"